ukc-docker/src/vhsm_dev/benchmark/ab_no_cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /tokenize
Document Length:        122 bytes

Concurrency Level:      10
Time taken for tests:   6.474 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      256000 bytes
Total body sent:        178000
HTML transferred:       122000 bytes
Requests per second:    154.46 [#/sec] (mean)
Time per request:       64.740 [ms] (mean)
Time per request:       6.474 [ms] (mean, across all concurrent requests)
Transfer rate:          38.62 [Kbytes/sec] received
                        26.85 kb/s sent
                        65.47 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    17   64  28.1     60     228
Waiting:       16   63  28.1     58     228
Total:         17   64  28.2     60     229

Percentage of the requests served within a certain time (ms)
  50%     60
  66%     70
  75%     77
  80%     81
  90%    100
  95%    116
  98%    143
  99%    165
 100%    229 (longest request)